Autodesk.Revit.DB.Electrical.ElectricalSystemType
Since:
2012
An enumerated type listing all the possible electrical system types for a connector object.
Since:
2012

Autodesk.Revit.DB.Electrical.ElectricalSystemType.PowerUnBalanced
Electrical System Type is PowerUnBalanced.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.PowerBalanced
Electrical System Type is PowerBalanced.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.Communication
Electrical System Type is Communication.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.Controls
Electrical System Type is Controls.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.NurseCall
System Type is NurseCall.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.FireAlarm
Electrical System Type is FireAlarm

Autodesk.Revit.DB.Electrical.ElectricalSystemType.Security
Electrical System Type is Security

Autodesk.Revit.DB.Electrical.ElectricalSystemType.Telephone
Electrical System Type is Telephone.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.PowerCircuit
Electrical System Type is PowerCircuit.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.Data
Electrical System Type is Data.

Autodesk.Revit.DB.Electrical.ElectricalSystemType.UndefinedSystemType
Undefined system type